# ðŸ‘» Handling Missing Values Before Visualization

#### Â» Import Seaborn and load the built-in 'planets' dataset

In [25]:
import seaborn as sns
planets = sns.load_dataset("planets")
df = planets.copy()
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [11]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

#### Â» Check whether the dataset contains NaN values

In [9]:
df.isnull().values.any()

np.True_

#### Â» Count NaN values per column

In [11]:
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

#### Â» Replace all NaN values in a specific column with 0

In [27]:
df.orbital_period = df.orbital_period.fillna(0)
df.isnull().sum()

method              0
number              0
orbital_period      0
mass              522
distance          227
year                0
dtype: int64

#### Â» Replace all NaN values in a specific column with the mean of dataframe

In [28]:
df.mass = df.mass.fillna(df.mass.mean())
df.isnull().sum()

method              0
number              0
orbital_period      0
mass                0
distance          227
year                0
dtype: int64

In [24]:
df = planets.copy()
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

#### Â» Another way to replace all NaN values in a specific column with 0

In [29]:
df.fillna({"orbital_period" : 0}, inplace=True)
df.isnull().sum()

method              0
number              0
orbital_period      0
mass                0
distance          227
year                0
dtype: int64

#### Â» Another way to replace all NaN values in a specific column with the mean of dataframe

In [30]:
df.fillna({"mass" : df.mass.mean()}, inplace=True)
df.isnull().sum()

method              0
number              0
orbital_period      0
mass                0
distance          227
year                0
dtype: int64

#### Â» Replace all NaN values in the entire DataFrame with 0

In [32]:
df = df.fillna(0)
df.isnull().sum()

method            0
number            0
orbital_period    0
mass              0
distance          0
year              0
dtype: int64